const posts = [
  {
    title: "دروس لا تُدرّس",
    content: `
      <h2>مقدمة</h2>
      <p>
في عالم الدراسة الجامعية، هناك الكثير مما نتعلمه في المقررات والمحاضرات. لكن الحقيقة أن هناك جانبًا آخر لا يُدرّس، ولا يُذكر إلا في تجارب الأفراد. من هذا المنطلق، تأتي سلسلة "دروس لا تُدرّس" لتسلط الضوء على تلك التفاصيل الصغيرة، لكنها العميقة في تأثيرها، مستمدة من تجارب شخصية صادقة، هدفها أن تختصر على القارئ الطريق، وتفتح أمامه أفقًا أوسع للتعلم والتطور.      </p>
      
      <h2>   الخوارزميات ليست مجرد مادة</h2>
      <p>
حين تصل إلى مقرر الخوارزميات وهياكل البيانات، ستدرك سريعًا أنه ليس مجرد متطلب جامعي، بل هو حجر الأساس لكل رحلة برمجية ناجحة.
النصيحة هنا واضحة:

ابدأ بإتقان الأساسيات (Data Types، Control Structures، Arrays، Classes) بنسبة لا تقل عن 80%.

ثم انتقل لفهم تعقيد الزمن والمساحة (Time & Space Complexity)، فهو ما سيمنحك القدرة على اختيار الخوارزميات المناسبة وتحسين الأداء.

📌 توصية: لا تكتفِ بالمقررات الجامعية فقط، بل استعن بالكورسات المتخصصة التي تشرح هذه المفاهيم بشكل عملي وتدريجي.      </p>
      
      <h2>Git و GitHub – أدوات لا غنى عنها </h2>
      <p>
في بداية الطريق قد تظن أن تعلم أدوات مثل Git وGitHub أمر ثانوي، لكن الحقيقة أنها تمثل نقطة تحول لكل مبرمج.
فهي ليست مجرد وسيلة لحفظ الأكواد، بل بوابة إلى:

العمل التعاوني على المشاريع.

إدارة الإصدارات باحترافية.

بناء ملف شخصي يعكس خبرتك ومشاريعك.

📌 توصية: خصص وقتًا لتعلّم هذه الأدوات من البداية، فهي استثمار طويل الأمد في مسيرتك البرمجية.      </p>
      
      <h2>البرمجة ليست مجرد تعلم… بل تطور </h2>
      <p>
كثيرون يعتقدون أن مشاهدة الكورسات وتنفيذ المشاريع الصغيرة كافية ليصبحوا "مبرمجين". لكن الواقع مختلف.
النقطة الفارقة كانت حين تغيّر السؤال:

بدلًا من "كيف أتعلم البرمجة؟" اسأل: "كيف أتطور في البرمجة؟"

وهنا تبدأ الخطوات الحقيقية:

خصص وقتًا قصيرًا يوميًا للتعلم.

دوّن الملاحظات وابحث بنفسك فيما يثير فضولك.

الأهم: طبّق ما تتعلمه على مشكلات واقعية من حياتك، فذلك هو ما يحول التعلم إلى خبرة عملية.      </p>
      
      <h2> التسويف عدوك الأول</h2>
      <p>
خلال سنوات الجامعة، وخصوصًا في المراحل التي تزداد فيها المشاريع والمحاضرات التطبيقية، قد تجد نفسك محاصرًا بالمهام.
أخطر خطأ يمكن أن تقع فيه هو التسويف.
النصيحة الذهبية هنا:

لا تؤجل مهامك.

نظّم وقتك بصرامة.

ضع دائمًا وقتًا احتياطيًا للطوارئ.

التسويف قد يبدو بسيطًا في البداية، لكنه يتراكم بسرعة ليصبح عبئًا كبيرًا يصعب تجاوزه.      </p>
      
 
      <h2>الخاتمة</h2>
      <p>
هذه الدروس الأربعة ليست بديلًا عن مقرراتك الجامعية، بل مكملًا لها. هي خبرات شخصية تُكتب بماء التجربة، لعلها تُلهمك أو تساعدك على تجاوز العقبات التي قد تواجهك في رحلتك.
وتذكّر: النجاح في البرمجة لا يأتي من حفظ الأكواد، بل من الفهم، الممارسة، وتنظيم الوقت.      </p>
    `,
    author: "المهندس أيمن",
    date: "2025-09-10",
    image: "image.png",
    category: "JavaScript",
  },
];
